
void Mission() {
  // ModeSpdPID(0, 100, -25);   //สูตรที่คิดค้นขึ้นเอง
  // ModeSpdPID(1, 100, -100);  //โหมดปกติทั้วไป(โหมด PID , ความเร็วสูงสุด, ความเร็วต่ำสุด)
  // ModeSpdPID(2, 100, -100);  //โหมดโค้งเยอะๆ(โหมด PID , ความเร็วสูงสุด, ความเร็วต่ำสุด)
  ModeSpdPID(3, 100, -100);  //สูตรที่คิดค้นขึ้นเอง
  // ModeSpdPID(4, 100, 0);     ////โหมดปกติทั้วไป

  RefLineValue(400);  //ค่าจับเส้น
  TrackLineColor(1);  // สีของเส้น 1 = ขาว , 0 = ดำ
  Dottedline(0);      //ไม่มีเส้นประใส่ 0  >> มีเส้นประใส่ 1


  TrackTimeForLineFast(4, 11, 40, 16, 20, 15000);  //TrackTimeForLineFast(เซนเซอร์ตัวแรก, ตัวสอง, ความเร็วเริ่มต้น, ความเร็วสูงสุด, kp, kd, เวลา);
  


  
}